package dp;
//750. 角矩形的数量
//
//
//
//
//        题目描述
//        评论 (2)
//        题解(4)New
//        提交记录
//        给定一个只包含 0 和 1 的网格，找出其中角矩形的数量。
//
//        一个 角矩形 是由四个不同的在网格上的 1 形成的轴对称的矩形。注意只有角的位置才需要为 1。并且，4 个 1 需要是不同的。
//
//
//
//        示例 1：
//
//        输入：grid =
//        [[1, 0, 0, 1, 0],
//        [0, 0, 1, 0, 1],
//        [0, 0, 0, 1, 0],
//        [1, 0, 1, 0, 1]]
//        输出：1
//        解释：只有一个角矩形，角的位置为 grid[1][2], grid[1][4], grid[3][2], grid[3][4]。
//
//
//        示例 2：
//
//        输入：grid =
//        [[1, 1, 1],
//        [1, 1, 1],
//        [1, 1, 1]]
//        输出：9
//        解释：这里有 4 个 2x2 的矩形，4 个 2x3 和 3x2 的矩形和 1 个 3x3 的矩形。
//
//
//        示例 3：
//
//        输入：grid =
//        [[1, 1, 1, 1]]
//        输出：0
//        解释：矩形必须有 4 个不同的角。
public class NumberOfCornerRectangles_750 {
    public int countCornerRectangles(int[][] grid) {
        return 0;
    }
}
